In [61]:
# Loading the CSV data

import pandas as pd
import sqlite3

orders = pd.read_csv(r"C:\Users\moham\Desktop\assignments\power BI\intership\orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [62]:
# Checking the details

orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  object
 4   total_amount     10000 non-null  float64
 5   restaurant_name  10000 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 468.9+ KB

In [63]:
# Loading the JSON file

users = pd.read_json(r"C:\Users\moham\Desktop\assignments\power BI\intership\users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [64]:
# Checking the details

users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     3000 non-null   int64
 1   name        3000 non-null   object
 2   city        3000 non-null   object
 3   membership  3000 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.9+ KB

In [65]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(":memory:")

with open(r"C:\Users\moham\Desktop\assignments\power BI\intership\restaurants.sql", "r") as f:
    sql_script = f.read()

conn.executescript(sql_script)

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [66]:
# Checking the details

restaurants.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   restaurant_id    500 non-null    int64
 1   restaurant_name  500 non-null    object
 2   cuisine          500 non-null    object
 3   rating           500 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 15.8+ KB

In [67]:
# Merging the dataset Orders + Users

df = orders.merge(users, on="user_id", how="left")

# Adding Restaurants to it

df = df.merge(restaurants, on="restaurant_id", how="left")

In [68]:
# Checking the final data
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [70]:
# Fixing the date format

df['order_date'] = pd.to_datetime(df['order_date'], dayfirst=True)

In [71]:
# Handling duplicate restaurant column names

df['restaurant_name'] = df['restaurant_name_x']

df.drop(columns=['restaurant_name_x', 'restaurant_name_y'],inplace=True)

In [85]:
# Checking the fianl data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  datetime64[ns]
 4   total_amount     10000 non-null  float64
 5   name             10000 non-null  object
 6   city             10000 non-null  object
 7   membership       10000 non-null  object
 8   cuisine          10000 non-null  object
 9   rating           10000 non-null  float64
 10  restaurant_name  10000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(3), object(5)
memory usage: 859.5+ KB

In [89]:
# Saving the final Dataset

df.to_csv(
    r"C:\Users\moham\Desktop\assignments\power BI\intership\final_food_delivery_dataset.csv",
    index=False
)

## Solving the MCQs

In [94]:
# City with highest revenue from Gold members

df[df['membership'] == 'Gold'] \
.groupby('city')['total_amount'].sum().idxmax()

'Chennai'

In [96]:
# Cuisine with highest average order value

df.groupby('cuisine')['total_amount'].mean().idxmax()

'Mexican'

In [100]:
# How many distinct users placed orders worth more than ₹1000 in total?

#Calculatimg total spend per user
user_total_spend = df.groupby('user_id')['total_amount'].sum()

#Counting users with spend > 1000
distinct_users_gt_1000 = (user_total_spend > 1000).sum()

distinct_users_gt_1000

np.int64(2544)

In [102]:
# Which restaurant rating range generated the highest total revenue?

# Creating the rating range
df['rating_range'] = pd.cut(
    df['rating'],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']
)

# Calulating the total revenue per range
rating_revenue = df.groupby('rating_range')['total_amount'].sum()
rating_revenue

C:\Users\moham\AppData\Local\Temp\ipykernel_30540\3099787202.py:11: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  rating_revenue = df.groupby('rating_range')['total_amount'].sum()

rating_range
3.0–3.5    1881754.57
3.6–4.0    1717494.41
4.1–4.5    1960326.26
4.6–5.0    2197030.75
Name: total_amount, dtype: float64

In [104]:
# Finding the highest among them

rating_revenue.idxmax()

'4.6–5.0'

In [106]:
# Among Gold members, which city has the highest average order value?

gold_city_aov = (df[df['membership'] == 'Gold'].groupby('city')['total_amount'].mean())
gold_city_aov.idxmax()

'Chennai'

In [108]:
# Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

cuisine_analysis = (
    df.groupby('cuisine')
    .agg(
        distinct_restaurants=('restaurant_id', 'nunique'),
        total_revenue=('total_amount', 'sum')
    )
    .sort_values(
        by=['distinct_restaurants', 'total_revenue'],
        ascending=[True, False]
    )
)
cuisine_analysis.index[0]

'Chinese'

In [110]:
# What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

# Total number of orders
total_orders = df.shape[0]

# Orders placed by Gold members
gold_orders = df[df['membership'] == 'Gold'].shape[0]

# Percentage of Gold orders
gold_order_percentage = round((gold_orders / total_orders) * 100)

gold_order_percentage

50

In [112]:
# Which restaurant has the highest average order value but less than 20 total orders?

restaurant_analysis = (
    df.groupby('restaurant_name')
    .agg(
        total_orders=('order_id', 'count'),
        avg_order_value=('total_amount', 'mean')
    )
)

# Filtering restaurants with less than 20 orders
filtered_restaurants = restaurant_analysis[
    restaurant_analysis['total_orders'] < 20
]

# Restaurant with highest average order value
filtered_restaurants.sort_values(
    by='avg_order_value',
    ascending=False
).head(1)

                          total_orders  avg_order_value
restaurant_name
Hotel Dhaba Multicuisine            13      1040.222308

In [114]:
# Which combination contributes the highest revenue?

combo_revenue = (df.groupby(['membership', 'cuisine'])['total_amount'].sum().sort_values(ascending=False))
combo_revenue.idxmax()

('Regular', 'Mexican')

In [116]:
# During which quarter of the year is the total revenue highest?

# Checking the date format
df['order_date'] = pd.to_datetime(df['order_date'], dayfirst=True)

# Extracting the quarter from it
df['quarter'] = df['order_date'].dt.quarter

# Calculating the revenue
quarter_revenue = df.groupby('quarter')['total_amount'].sum()

quarter_revenue.idxmax()

np.int32(3)

In [118]:
# How many total orders were placed by users with Gold membership?

# Filtering Gold member orders
gold_orders_df = df[df['membership'] == 'Gold']

# Counting total orders placed by Gold members
total_gold_orders = gold_orders_df.shape[0]

total_gold_orders

4987

In [120]:
# What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

# Filtering Hyderabad orders
hyderabad_orders = df[df['city'] == 'Hyderabad']

# Calculating total revenue
hyderabad_revenue = hyderabad_orders['total_amount'].sum()

# Rounding to nearest integer
round(hyderabad_revenue)

1889367

In [122]:
# How many distinct users placed at least one order?

# Count distinct users who placed at least one order
distinct_users = df['user_id'].nunique()

distinct_users

2883

In [124]:
# What is the average order value (rounded to 2 decimals) for Gold members?

# Filter Gold member orders
gold_orders = df[df['membership'] == 'Gold']

# Calculate average order value
gold_aov = round(gold_orders['total_amount'].mean(), 2)

gold_aov

np.float64(797.15)

In [126]:
# How many orders were placed for restaurants with rating ≥ 4.5?

# Filter orders for restaurants with rating >= 4.5
high_rating_orders = df[df['rating'] >= 4.5]

# Count total orders
high_rating_orders_count = high_rating_orders.shape[0]

high_rating_orders_count

3374

In [128]:
# How many orders were placed in the top revenue city among Gold members only?

# Filering the Gold members orders
gold_df = df[df['membership'] == 'Gold']

# Filgtering the top revenue gold members
top_gold_city = (gold_df.groupby('city')['total_amount'].sum().idxmax())

# Counting the orders in that city
gold_orders_top_city = gold_df[gold_df['city'] == top_gold_city].shape[0]

gold_orders_top_city

1337

In [132]:
# The total number of rows in the final merged dataset is __________.

df.shape

(10000, 13)